Revit 2024 API
OBJExportOptions.IsMaxEdgeLengthSet Method
 Checks whether the MaxEdgeLength tessellation parameter is explicitly set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public bool IsMaxEdgeLengthSet()
Visual Basic
Public Function IsMaxEdgeLengthSet As Boolean
Visual C++
public:
bool IsMaxEdgeLengthSet()
Return Value
 True if MaxEdgeLength tessellation parameter is explicitly set, false otherwise.
See Also
OBJExportOptions Class
Autodesk.Revit.DB Namespace